--1.
select ("Н_ЛЮДИ"."ФАМИЛИЯ", "Н_ВЕДОМОСТИ"."ДАТА")
from "Н_ЛЮДИ"
         INNER JOIN "Н_ВЕДОМОСТИ" on "Н_ЛЮДИ"."ИД" = "Н_ВЕДОМОСТИ"."ЧЛВК_ИД"
WHERE "Н_ЛЮДИ"."ФАМИЛИЯ" = 'Ёлкин'
  AND "Н_ВЕДОМОСТИ"."ДАТА" > '2022-06-08';

--2.
select ("Н_ЛЮДИ"."ФАМИЛИЯ", "Н_ВЕДОМОСТИ"."ЧЛВК_ИД", "Н_СЕССИЯ"."ДАТА")
from "Н_ЛЮДИ"
         INNER JOIN "Н_ВЕДОМОСТИ" on "Н_ЛЮДИ"."ИД" = "Н_ВЕДОМОСТИ"."ЧЛВК_ИД"
         INNER JOIN "Н_СЕССИЯ" on "Н_ЛЮДИ"."ИД" = "Н_СЕССИЯ"."ЧЛВК_ИД"
WHERE "Н_ЛЮДИ"."ФАМИЛИЯ" < 'Александр'
  AND "Н_ВЕДОМОСТИ"."ЧЛВК_ИД" < 117219;

--3.
select count(*) from "Н_УЧЕНИКИ"
INNER JOIN "Н_ЛЮДИ" on "Н_ЛЮДИ"."ИД" = "Н_УЧЕНИКИ"."ЧЛВК_ИД"
    where "ГРУППА"='3102'
        and date_part('year', age("Н_ЛЮДИ"."ДАТА_РОЖДЕНИЯ")) >= 25;

--4.
select НЛ."ИМЯ", count("ИМЯ") from "Н_УЧЕНИКИ"
    INNER JOIN "Н_ЛЮДИ" НЛ on "Н_УЧЕНИКИ"."ЧЛВК_ИД" = НЛ."ИД"
group by НЛ."ИМЯ"; -- todo >50 ФКТиУ



select ("Н_УЧЕНИКИ"."ИД", НЛ."ФИО", AVG("Н_ОЦЕНКИ"."СОРТ")) from "Н_УЧЕНИКИ"
    INNER JOIN "Н_ЛЮДИ" НЛ on "Н_УЧЕНИКИ"."ЧЛВК_ИД" = НЛ."ИД"
    INNER JOIN "Н_ВЕДОМОСТИ" НВ on "Н_УЧЕНИКИ"."ЧЛВК_ИД" = НВ."ЧЛВК_ИД"
    INNER JOIN "Н_ОЦЕНКИ" on НВ."ОЦЕНКА"="Н_ОЦЕНКИ"."КОД"